Revit 2027 API
Subelement.GetGeometryObject Method
 Retrieve one geometric primitive representing given subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GeometryObject GetGeometryObject(
	View dbView
)
Public Function GetGeometryObject (
	dbView As View
) As GeometryObject
public:
GeometryObject^ GetGeometryObject(
	View^ dbView
)
member GetGeometryObject :
        dbView : View -> GeometryObject
Parameters
dbView View
 The view for view-specific geometry or null for model geometry.
Return Value
GeometryObject
 The geometric object representing this subelement.
Remarks
 In case of whole element, geometric object representing element and its subelements will be returned. null will be returned if related geometric object could not be found in the model.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace